app/Controllers/InicioSesion.php

SELECT *
FROM `Usuarios`
WHERE `email` = 'nachonavarro197@gmail.com'
 LIMIT 1
---
    public function login()
    {
        //Instanciamos modelo de usuario
        $usuarioModelo = new UsuarioModelo();

        // Cargar la librería de validación
        $validation = Services::validation();
        $validation->setRules([
            'email'   => 'required|valid_email',
            'password' => 'required'
        ]);
        // Validación de formulario
        if ($this->request->getMethod() === 'POST') {
            // Reglas de validación

            if (!$validation->withRequest($this->request)->run()) {
                return redirect()->back()->withInput()->with('errors', $validation->getErrors());
            }

            // Obtener datos del formulario
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Buscar usuario por email
            $usuario = $usuarioModelo->where('email', $email)->first();