app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '7'
---
    public function modificacionProducto()
    {
        log_message('debug', 'Archivos recibidos: ' . print_r($this->request->getFiles(), true));

        $idProducto = $this->request->getPost('id_producto');
        $productoModelo = new ProductoModelo();
        $producto = $productoModelo->find($idProducto);

UPDATE `productos` SET `precio` = '15000'
WHERE `productos`.`id_producto` IN ('7')
---

            // Actualizar producto si hay cambios
            if (!empty($datos)) {
                if (!$productoModelo->update($idProducto, $datos)) {

DELETE FROM `categorias_productos`
WHERE `id_producto` = '7'
INSERT INTO `categorias_productos` (`id_producto`, `id_categoria`) VALUES ('7', '3')
---
            // Actualizar categorías asociadas
            $idsCategorias = $this->request->getPost('id_categoria');
            $categoriasProductosModelo = new \App\Models\CategoriasProductosModelo();
            $categoriasProductosModelo->where('id_producto', $idProducto)->delete();

            if (is_array($idsCategorias)) {
                foreach ($idsCategorias as $idCat) {
                    $categoriasProductosModelo->insert([
                        'id_producto' => $idProducto,
                        'id_categoria' => $idCat
                    ]);