app/Controllers/Ventas.php

SELECT *
FROM `ventas`
WHERE `ventas`.`id_venta` = '11'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '5'
---
    public function detalleCompra($idVenta)
    {
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Para ver el detalle de la compra, inicia sesión.');
            return redirect()->to('/login');
        }

        $idUsuario = session()->get('id_usuario');
        if (!$idUsuario) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión.');
        }

        $ventaModel = new VentaModelo();
        $detalleModel = new DetalleVentaModelo();
        $productoModel = new ProductoModelo();

        $venta = $ventaModel->find($idVenta);
        if (!$venta || $venta['id_usuario'] != $idUsuario) {
            session()->setFlashdata('error', 'Compra no encontrada o no autorizada.');
            return redirect()->to('/mis-compras');
        }

        $detalles = $detalleModel->where('id_venta', $idVenta)->findAll();

        foreach ($detalles as &$detalle) {
            $producto = $productoModel->find($detalle['id_producto']);

SELECT `ventas`.*, `usuarios`.`nombre` AS `nombre_usuario`
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas`.`id_usuario`
ORDER BY `fecha_venta` DESC
---
    public function historialVentas()
    {
        if (!session()->get('logged_in') || session()->get('tipo_usuario') !== 'admin') {
            session()->setFlashdata('error', 'Acceso no autorizado, debes ser administrador para acceder a esta página.');
            return redirect()->to('/login');
        }

        $ventasModelo = new VentaModelo();

        $ventasModelo->select('ventas.*, usuarios.nombre AS nombre_usuario');
        $ventasModelo->join('usuarios', 'usuarios.id_usuario = ventas.id_usuario');
        $ventasModelo->orderBy('fecha_venta', 'DESC');

        $ventas = $ventasModelo->findAll();